#### Terraform working directory 🏠: `demo/demo-account/demo-application/resources`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ebs_volume.this["/dev/sdb"] will be destroyed
  # (because key ["/dev/sdb"] is not in for_each map)
  - resource "aws_ebs_volume" "this" {
      - arn                  = "arn:aws:ec2:ap-southeast-1:129980683758:volume/vol-0de848d9bf3d228f2" -> null
      - availability_zone    = "ap-southeast-1a" -> null
      - encrypted            = true -> null
      - final_snapshot       = false -> null
      - id                   = "vol-0de848d9bf3d228f2" -> null
      - iops                 = 3000 -> null
      - kms_key_id           = "arn:aws:kms:ap-southeast-1:129980683758:key/6dc66ab3-fb16-4eb2-8a7a-5be1bee5e2ee" -> null
      - multi_attach_enabled = false -> null
      - size                 = 4 -> null
      - tags                 = {
          - "GroupName"     = "swap"
          - "Name"          = "ansible-testhost5/swap/0"
          - "VolumeManager" = "none"
        } -> null
      - tags_all             = {
          - "GroupName"     = "swap"
          - "Name"          = "ansible-testhost5/swap/0"
          - "VolumeManager" = "none"
        } -> null
      - throughput           = 125 -> null
      - type                 = "gp3" -> null
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ebs_volume.this["/dev/sdc"] will be destroyed
  # (because key ["/dev/sdc"] is not in for_each map)
  - resource "aws_ebs_volume" "this" {
      - arn                  = "arn:aws:ec2:ap-southeast-1:129980683758:volume/vol-0daa7f49af3dee6f0" -> null
      - availability_zone    = "ap-southeast-1a" -> null
      - encrypted            = true -> null
      - final_snapshot       = false -> null
      - id                   = "vol-0daa7f49af3dee6f0" -> null
      - iops                 = 3000 -> null
      - kms_key_id           = "arn:aws:kms:ap-southeast-1:129980683758:key/6dc66ab3-fb16-4eb2-8a7a-5be1bee5e2ee" -> null
      - multi_attach_enabled = false -> null
      - size                 = 40 -> null
      - tags                 = {
          - "GroupName"     = "ebsa"
          - "Name"          = "ansible-testhost5/ebsa/0"
          - "VolumeManager" = "lvm"
        } -> null
      - tags_all             = {
          - "GroupName"     = "ebsa"
          - "Name"          = "ansible-testhost5/ebsa/0"
          - "VolumeManager" = "lvm"
        } -> null
      - throughput           = 125 -> null
      - type                 = "gp3" -> null
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ebs_volume.this["ebsa"] will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = (known after apply)
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 40
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "ebsa"
        }
      + tags_all          = {
          + "Name" = "ebsa"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["Create_Auto_Alarms"] must be replaced
-/+ resource "aws_ec2_tag" "instance" {
      ~ id          = "i-070a89f24d66596d9,Create_Auto_Alarms" -> (known after apply)
      ~ resource_id = "i-070a89f24d66596d9" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["Name"] must be replaced
-/+ resource "aws_ec2_tag" "instance" {
      ~ id          = "i-070a89f24d66596d9,Name" -> (known after apply)
      ~ resource_id = "i-070a89f24d66596d9" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["Swappiness"] will be destroyed
  # (because key ["Swappiness"] is not in for_each map)
  - resource "aws_ec2_tag" "instance" {
      - id          = "i-070a89f24d66596d9,Swappiness" -> null
      - key         = "Swappiness" -> null
      - resource_id = "i-070a89f24d66596d9" -> null
      - value       = "0" -> null
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["UseSwapFile"] will be destroyed
  # (because key ["UseSwapFile"] is not in for_each map)
  - resource "aws_ec2_tag" "instance" {
      - id          = "i-070a89f24d66596d9,UseSwapFile" -> null
      - key         = "UseSwapFile" -> null
      - resource_id = "i-070a89f24d66596d9" -> null
      - value       = "false" -> null
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["role"] must be replaced
-/+ resource "aws_ec2_tag" "instance" {
      ~ id          = "i-070a89f24d66596d9,role" -> (known after apply)
      ~ resource_id = "i-070a89f24d66596d9" # forces replacement -> (known after apply) # forces replacement
      ~ value       = "binigbing" -> "catty eat cookies"
        # (1 unchanged attribute hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["GroupName"] must be replaced
-/+ resource "aws_ec2_tag" "rbd" {
      ~ id          = "vol-08eb8559b0db8ffab,GroupName" -> (known after apply)
      ~ resource_id = "vol-08eb8559b0db8ffab" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["Mountpoint"] must be replaced
-/+ resource "aws_ec2_tag" "rbd" {
      ~ id          = "vol-08eb8559b0db8ffab,Mountpoint" -> (known after apply)
      ~ resource_id = "vol-08eb8559b0db8ffab" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["Name"] must be replaced
-/+ resource "aws_ec2_tag" "rbd" {
      ~ id          = "vol-08eb8559b0db8ffab,Name" -> (known after apply)
      ~ resource_id = "vol-08eb8559b0db8ffab" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_instance.this must be replaced
-/+ resource "aws_instance" "this" {
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:129980683758:instance/i-070a89f24d66596d9" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-070a89f24d66596d9" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ primary_network_interface_id         = "eni-0d99013c808636eb8" -> (known after apply)
      ~ private_dns                          = "ip-172-18-76-38.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.18.76.38" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      - tags                                 = {
          - "Create_Auto_Alarms" = "true"
          - "Name"               = "ansible-testhost5"
          - "Swappiness"         = "0"
          - "UseSwapFile"        = "false"
          - "role"               = "binigbing"
        } -> null
      ~ tags_all                             = {
          - "Create_Auto_Alarms" = "true"
          - "Name"               = "ansible-testhost5"
          - "Swappiness"         = "0"
          - "UseSwapFile"        = "false"
          - "role"               = "binigbing"
        } -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (18 unchanged attributes hidden)

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 3000 -> null
          - kms_key_id            = "arn:aws:kms:ap-southeast-1:129980683758:key/6dc66ab3-fb16-4eb2-8a7a-5be1bee5e2ee" -> null
          - tags                  = {
              - "GroupName"     = "swap"
              - "Name"          = "ansible-testhost5/swap/0"
              - "VolumeManager" = "none"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0de848d9bf3d228f2" -> null
          - volume_size           = 4 -> null
          - volume_type           = "gp3" -> null
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdc" -> null
          - encrypted             = true -> null
          - iops                  = 3000 -> null
          - kms_key_id            = "arn:aws:kms:ap-southeast-1:129980683758:key/6dc66ab3-fb16-4eb2-8a7a-5be1bee5e2ee" -> null
          - tags                  = {
              - "GroupName"     = "ebsa"
              - "Name"          = "ansible-testhost5/ebsa/0"
              - "VolumeManager" = "lvm"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0daa7f49af3dee6f0" -> null
          - volume_size           = 40 -> null
          - volume_type           = "gp3" -> null
        }

      + instance_market_options { # forces replacement
          + market_type = "spot" # forces replacement

          + spot_options { # forces replacement
              + instance_interruption_behavior = "terminate" # forces replacement
              + max_price                      = (known after apply)
              + spot_instance_type             = "one-time" # forces replacement
              + valid_until                    = (known after apply)
            }
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {
              - "GroupName"  = "root"
              - "Mountpoint" = "/"
              - "Name"       = "ansible-testhost5/root/0"
            } -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-08eb8559b0db8ffab" -> (known after apply)
          ~ volume_size           = 10 -> 15
          ~ volume_type           = "gp2" -> "gp3"
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_volume_attachment.this["/dev/sdb"] will be destroyed
  # (because key ["/dev/sdb"] is not in for_each map)
  - resource "aws_volume_attachment" "this" {
      - device_name = "/dev/sdb" -> null
      - id          = "vai-3721751119" -> null
      - instance_id = "i-070a89f24d66596d9" -> null
      - volume_id   = "vol-0de848d9bf3d228f2" -> null
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_volume_attachment.this["/dev/sdc"] will be destroyed
  # (because key ["/dev/sdc"] is not in for_each map)
  - resource "aws_volume_attachment" "this" {
      - device_name = "/dev/sdc" -> null
      - id          = "vai-3392613575" -> null
      - instance_id = "i-070a89f24d66596d9" -> null
      - volume_id   = "vol-0daa7f49af3dee6f0" -> null
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_volume_attachment.this["ebsa"] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "ebsa"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 9 to add, 0 to change, 13 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
